{
  "modelTopology": {
    "keras_version": "2.4.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": [
        {
          "class_name": "Dense",
          "config": {
            "units": 32,
            "activation": "relu",
            "input_shape": [7]
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 16,
            "activation": "relu"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 1,
            "activation": "sigmoid"
          }
        }
      ]
    }
  },
  "weightsManifest": [
    {
      "paths": ["./anomaly_detector_weights.bin"],
      "weights": []
    }
  ]
}